workspace/Catalogs/АукАукционы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>АукАукционы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидАукциона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АукВидыАукционов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Срок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторИзменения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийАукцион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АукАукционы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическийСтарт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическийПереходКПодведениюПромежуточныхИтогов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическоеПодведениеПромежуточныхИтогов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическийПереходКПодведениюОкончательныхИтогов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическоеПодведениеОкончательныхИтогов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮрЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Участники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Участник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АукУчастникиАукционов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтактноеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АукКонтактныеЛицаУчастниковАукционов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НачальныеДанные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Участник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АукУчастникиАукционов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрокаНачальныхДанных</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭлементНачальныхДанных</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.АукЭлементыДанныхАукционов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеНачальныхДанных</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.АукЭлементыДанныхАукционов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Этапы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Этап</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>64</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДлительностьДни</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДлительностьЧасы</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Параметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.АукЭлементыДанныхАукционов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПараметра</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.АукЭлементыДанныхАукционов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

workspace/InformationRegisters/АукИсторияСтатусовАукционов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>АукИсторияСтатусовАукционов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.АукСтатусыАукционов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>НомерЭтапа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Этап</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Аукцион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АукАукционы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

workspace/InformationRegisters/АукИсторияКомандАукционов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>АукИсторияКомандАукционов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Автоматическая</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АукКаналыВзаимодействия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючРодителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиУникальности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>cfg:EnumRef.АукРезультатыВыполненияКоманд</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аукцион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АукАукционы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Команда</Name>
					<Type>
						<v8:Type>cfg:EnumRef.АукКоманды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Участник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АукУчастникиАукционов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АукКонтактныеЛицаУчастниковАукционов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>КлючКоманды</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиУникальности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

workspace/Enums/АукСтатусыАукционов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>АукСтатусыАукционов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодведениеПромежуточныхИтогов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НовыйЭтап</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодведениеИтогов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Архив</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

workspace/Enums/АукКоманды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>АукКоманды</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АвтоПроверкаНачатьАукцион</Name>
					<Comment>AutoCheckStartAuction</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачатьАукцион</Name>
					<Comment>StartAuction</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АвтоПроверкаПерейтиКПодведениюПромежуточныхИтогов</Name>
					<Comment>AutoCheckEnterInterimSummary</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПерейтиКПодведениюПромежуточныхИтогов</Name>
					<Comment>EnterInterimSummary</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АвтоПроверкаПодвестиПромежуточныеИтоги</Name>
					<Comment>AutoCheckSummarizeInterimResults</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РассчитатьПромежуточныеИтоги</Name>
					<Comment>CalculateInterimResults</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗафиксироватьПромежуточныеИтоги</Name>
					<Comment>RecordInterimResults</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АвтоПроверкаПерейтиКПодведениюИтогов</Name>
					<Comment>AutoCheckEnterSummarizeTotalResults</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПерейтиКПодведениюИтогов</Name>
					<Comment>EnterSummarizeTotalResults</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АвтоПроверкаПодвестиИтогиАукциона</Name>
					<Comment>AutoCheckSummarizeTotalResults</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РассчитатьИтогиАукциона</Name>
					<Comment>CalculateTotalResults</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗафиксироватьИтогиАукциона</Name>
					<Comment>RecordTotalResults</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоместитьВАрхив</Name>
					<Comment>PutInArchive</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменитьАукцион</Name>
					<Comment>CancelAuction</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолучитьДанныеОтУчастника</Name>
					<Comment>GetDataFromParticipant</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправитьСообщениеУчастнику</Name>
					<Comment>SendMessageToParticipant</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправитьСообщениеАвтору</Name>
					<Comment>SendMessageToAuthor</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

workspace/Catalogs/АукАукционы/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Функция СведенияПоЭтапуАукциона(пАукцион, пНомерЭтапа = 1) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Аук_АукционыЭтапы.Этап КАК Этап,
	|	Аук_АукционыЭтапы.ДлительностьДни КАК ДлительностьДни,
	|	Аук_АукционыЭтапы.ДлительностьЧасы КАК ДлительностьЧасы,
	|	Аук_АукционыЭтапы.НомерСтроки КАК НомерЭтапа
	|ИЗ
	|	Справочник.АукАукционы.Этапы КАК Аук_АукционыЭтапы
	|ГДЕ
	|	Аук_АукционыЭтапы.Ссылка = &Аукцион
	|	И Аук_АукционыЭтапы.НомерСтроки = &НомерЭтапа";
	
	Запрос.УстановитьПараметр("Аукцион",	пАукцион);
	Запрос.УстановитьПараметр("НомерЭтапа",	пНомерЭтапа);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат ЭдоОбщийСервер.РезультатЗапросаВСтруктуру(РезультатЗапроса);
КонецФункции

Функция ЭтапыАукциона(пАукцион, пБулВТаблицуЗначений = Ложь) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Аук_АукционыЭтапы.Этап КАК Этап,
	|	Аук_АукционыЭтапы.ДлительностьДни КАК ДлительностьДни,
	|	Аук_АукционыЭтапы.ДлительностьЧасы КАК ДлительностьЧасы,
	|	Аук_АукционыЭтапы.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	Справочник.АукАукционы.Этапы КАК Аук_АукционыЭтапы
	|ГДЕ
	|	Аук_АукционыЭтапы.Ссылка = &Аукцион";
	
	Запрос.УстановитьПараметр("Аукцион",	пАукцион);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если пБулВТаблицуЗначений Тогда
		Возврат РезультатЗапроса.Выгрузить();	
	Иначе	
		Возврат ЭдоОбщийСервер.РезультатЗапросаВМассивСтруктур(РезультатЗапроса);
	КонецЕсли;
КонецФункции

// Если текущий статус аукциона "НовыйЭтап" или "ПодведениеПромежуточныхИтогов" тогда создаем снимок
//
Функция ТребуетсяЗаписьВИсторию(пАукцион) Экспорт
	булРезультат = Ложь;
	
	сткТекСтатусАукциона = РегистрыСведений.АукИсторияСтатусовАукционов.ТекущееСостояниеАукциона(пАукцион);
	
	Если сткТекСтатусАукциона.Статус = ПредопределенноеЗначение("Перечисление.АукСтатусыАукционов.НовыйЭтап")
		 Или сткТекСтатусАукциона.Статус = ПредопределенноеЗначение("Перечисление.АукСтатусыАукционов.ПодведениеПромежуточныхИтогов")
	Тогда	 
		булРезультат = Истина;
	КонецЕсли;
		
	Возврат булРезультат;	
КонецФункции

Функция КлючевыеДанныеАукциона(пАукцион) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АукАукционы.ВидАукциона КАК ВидАукциона,
	|	АукАукционы.Сумма КАК Сумма,
	|	АукАукционы.Срок КАК Срок,
	|	АукАукционы.ДатаНачала КАК ДатаНачала,
	|	АукАукционы.Наименование КАК Наименование,
	|	АукАукционы.Код КАК Код
	|ИЗ
	|	Справочник.АукАукционы КАК АукАукционы
	|ГДЕ
	|	АукАукционы.Ссылка = &Аукцион";
	
	Запрос.УстановитьПараметр("Аукцион", пАукцион);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат ЭдоОбщийСервер.РезультатЗапросаВСтруктуру(РезультатЗапроса);
	
КонецФункции

Функция НастройкиАвтоматическогоВыполненияАукциона(пАукцион) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АукАукционы.АвтоматическийСтарт КАК АвтоматическийСтарт,
	|	АукАукционы.АвтоматическийПереходКПодведениюПромежуточныхИтогов КАК АвтоматическийПереходКПодведениюПромежуточныхИтогов,
	|	АукАукционы.АвтоматическоеПодведениеПромежуточныхИтогов КАК АвтоматическоеПодведениеПромежуточныхИтогов,
	|	АукАукционы.АвтоматическийПереходКПодведениюОкончательныхИтогов КАК АвтоматическийПереходКПодведениюОкончательныхИтогов,
	|	АукАукционы.АвтоматическоеПодведениеОкончательныхИтогов КАК АвтоматическоеПодведениеОкончательныхИтогов
	|ИЗ
	|	Справочник.АукАукционы КАК АукАукционы
	|ГДЕ
	|	АукАукционы.Ссылка = &Аукцион";
	
	Запрос.УстановитьПараметр("Аукцион", пАукцион);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат ЭдоОбщийСервер.РезультатЗапросаВСтруктуру(РезультатЗапроса);
	
КонецФункции

Процедура СоздатьСнимокТекущегоАукциона(пТекОбъектАукцион) Экспорт

	НовОбъект = АукОбщийСервер.СоздатьКопиюСуществующегоЭлементаСправочника(пТекОбъектАукцион);
	
	НовОбъект.ТекущийАукцион	= пТекОбъектАукцион.Ссылка;
	НовОбъект.Наименование		= СтрШаблон("%1 <%2>", пТекОбъектАукцион.Наименование, ПорядковыйНомерСнимка(пТекОбъектАукцион.Ссылка));
	
	сткРез = ОбщегоНазначения.ЗаписатьОбъектВБазу(НовОбъект);
	
	Если Не сткРез.Успех Тогда
		ВызватьИсключение сткРез.Ошибка;	
	КонецЕсли;	
	
КонецПроцедуры

Функция КоличествоЭтаповАукциона(пАукцион) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МАКСИМУМ(Аук_АукционыЭтапы.НомерСтроки) КАК НомерСтроки
	|ИЗ
	|	Справочник.АукАукционы.Этапы КАК Аук_АукционыЭтапы
	|ГДЕ
	|	Аук_АукционыЭтапы.Ссылка = &Аукцион";
	
	Запрос.УстановитьПараметр("Аукцион", пАукцион);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Возврат 0;
		
	Иначе	
		Выборка = РезультатЗапроса.Выбрать();
		
		Выборка.Следующий();
		
		Возврат Выборка.НомерСтроки;
	КонецЕсли;	
	
КонецФункции	

Функция КонтактныеЛицаСПривязкойКУчастникам(пАукцион, пУчасники = Неопределено, пБулВТаблицуЗначений = Истина) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Аук_АукционыУчастники.Участник КАК Участник,
	|	Аук_АукционыУчастники.КонтактноеЛицо КАК КонтактноеЛицо
	|ИЗ
	|	Справочник.АукАукционы.Участники КАК Аук_АукционыУчастники
	|ГДЕ
	|	Аук_АукционыУчастники.Ссылка = &Аукцион
	|	И &ОтборПоУчастникам";
	
	Если пУчасники <> Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоУчастникам", "Аук_АукционыУчастники.Участник В (&Участники)");
		
		Запрос.УстановитьПараметр("Участники", пУчасники);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоУчастникам", "ИСТИНА");	
	КонецЕсли;	
	
	Запрос.УстановитьПараметр("Аукцион", пАукцион);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если пБулВТаблицуЗначений Тогда 	
		Возврат РезультатЗапроса.Выгрузить();	
	Иначе
		Возврат ЭдоОбщийСервер.РезультатЗапросаВМассивСтруктур(РезультатЗапроса);
	КонецЕсли;
	
КонецФункции

Функция КонтактныеЛицаУчастникаАукциона(пАукцион, пУчастник) Экспорт
	
	тзТемп = КонтактныеЛицаСПривязкойКУчастникам(пАукцион);
	
	масСтроки = тзТемп.НайтиСтроки(Новый Структура("Участник", пУчастник));
	
	Возврат ОбщегоНазначенияКлиентСервер.ВыгрузитьКолонку(масСтроки, "КонтактноеЛицо", Истина);
	
КонецФункции

Функция УчастникиАукциона(пАукцион, пБулВМассивСтруктур = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Аук_АукционыУчастники.Участник КАК Участник
	|ИЗ
	|	Справочник.АукАукционы.Участники КАК Аук_АукционыУчастники
	|ГДЕ
	|	Аук_АукционыУчастники.Ссылка = &Аукцион";
	
	Запрос.УстановитьПараметр("Аукцион", пАукцион);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если пБулВМассивСтруктур Тогда
		Возврат ЭдоОбщийСервер.РезультатЗапросаВМассивСтруктур(РезультатЗапроса);
	Иначе
		Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Участник");	
	КонецЕсли;	
	
КонецФункции

Функция ЗначенияНачальныхДанных(пАукцион, пВидАукциона = Неопределено, пУчастник = Неопределено) Экспорт
	
	Запрос = ЗначенияНачальныхДанных_Запрос(пАукцион, пВидАукциона, пУчастник);
	
	ПосленийПакет = АукОбщийСервер.СвойстваПоследнегоПакетаЗапроса(Запрос.Текст);
	
	масСтруктураНачДанных = Справочники.АукВидыАукционов.ОписаниеСтруктурыНачальныхДанныхПоВидуАукциона(пВидАукциона);
	
	тзРезультат = АукОбщийСервер.СоздатьТаблицуПоСоставуКолонок(ПосленийПакет.Колонки, "ЗначениеЭлементаДанных,ТехническоеНаименование", масСтруктураНачДанных);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	АукОбщийСервер.ЗаполнитьДанныеУчастниковПоРезультатуЗапроса(тзРезультат, РезультатЗапроса,
				ПосленийПакет.КонтрольныеТочкиИтогов.Количество(), "ТехническоеНаименование", "ЗначениеЭлементаДанных");
	
	Возврат тзРезультат;
	
КонецФункции

Функция ЗначенияНачальныхДанныхСГруппировками(пАукцион, пВидАукциона = Неопределено, пУчастник = Неопределено) Экспорт
		
	Запрос = ЗначенияНачальныхДанных_Запрос(пАукцион, пВидАукциона, пУчастник);
	
	Возврат Запрос.Выполнить();
	
КонецФункции

Функция ЗначенияНачальныхДанныхНезаписанногоОбъекта(пТзТабличнаяЧасть, пВидАукциона) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	тзТабличнаяЧасть.Участник КАК Участник,
	|	тзТабличнаяЧасть.СтрокаНачальныхДанных КАК СтрокаДанных,
	|	тзТабличнаяЧасть.ЭлементНачальныхДанных КАК ЭлементДанных,
	|	тзТабличнаяЧасть.ЗначениеНачальныхДанных КАК ЗначениеЭлементаДанных
	|ПОМЕСТИТЬ втТабличнаяЧасть
	|ИЗ
	|	&тзТабличнаяЧасть КАК тзТабличнаяЧасть
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТабличнаяЧасть.Участник КАК Участник,
	|	втТабличнаяЧасть.СтрокаДанных КАК СтрокаДанных,
	//|	втТабличнаяЧасть.ЭлементДанных КАК ЭлементДанных,
	|	втТабличнаяЧасть.ЗначениеЭлементаДанных КАК ЗначениеЭлементаДанных,
	|	АукЭлементыДанныхАукционов.ТехническоеНаименование КАК ТехническоеНаименование
	|ИЗ
	|	втТабличнаяЧасть КАК втТабличнаяЧасть
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.АукЭлементыДанныхАукционов КАК АукЭлементыДанныхАукционов
	|		ПО втТабличнаяЧасть.ЭлементДанных = АукЭлементыДанныхАукционов.Ссылка
	|ИТОГИ ПО
	|	Участник,
	|	СтрокаДанных";
	
	Запрос.УстановитьПараметр("тзТабличнаяЧасть", пТзТабличнаяЧасть);
	
	ПосленийПакет = АукОбщийСервер.СвойстваПоследнегоПакетаЗапроса(Запрос.Текст);
	
	масСтруктураНачДанных = Справочники.АукВидыАукционов.ОписаниеСтруктурыНачальныхДанныхПоВидуАукциона(пВидАукциона);
	
	тзРезультат = АукОбщийСервер.СоздатьТаблицуПоСоставуКолонок(ПосленийПакет.Колонки, "СтрокаДанных,ЗначениеЭлементаДанных,ТехническоеНаименование", масСтруктураНачДанных);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	АукОбщийСервер.ЗаполнитьДанныеУчастниковПоРезультатуЗапроса(тзРезультат, РезультатЗапроса,
				ПосленийПакет.КонтрольныеТочкиИтогов.Количество(), "ТехническоеНаименование", "ЗначениеЭлементаДанных");
	
	Возврат тзРезультат;
	
КонецФункции

Функция КоличествоСнимковТекущегоАукциона(пАукцион) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(АукАукционы.Ссылка) КАК Количество
	|ИЗ
	|	Справочник.АукАукционы КАК АукАукционы
	|ГДЕ
	|	АукАукционы.ТекущийАукцион = &ТекущийАукцион";
	
	Запрос.УстановитьПараметр("ТекущийАукцион", пАукцион);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Возврат 0;
		
	Иначе
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Выборка.Следующий();
		
		Возврат Выборка.Количество;
		
	КонецЕсли;	
	
КонецФункции

Функция ЕстьАукционыСВидом(пВидАукциона) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	 "ВЫБРАТЬ ПЕРВЫЕ 1
	 |	АукАукционы.Ссылка КАК Ссылка
	 |ИЗ
	 |	Справочник.АукАукционы КАК АукАукционы
	 |ГДЕ
	 |	АукАукционы.ВидАукциона = &ВидАукциона";
	
	Запрос.УстановитьПараметр("ВидАукциона", пВидАукциона);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции	

Функция ОтветственныеЛицаПоАукциону(пАукцион) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АукАукционы.Автор КАК Автор,
	|	АукАукционы.АвторИзменения КАК АвторИзменения
	|ПОМЕСТИТЬ втТемп
	|ИЗ
	|	Справочник.АукАукционы КАК АукАукционы
	|ГДЕ
	|	АукАукционы.Ссылка = &Аукцион
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТемп.Автор КАК Ответственный
	|ИЗ
	|	втТемп КАК втТемп
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	втТемп.АвторИзменения
	|ИЗ
	|	втТемп КАК втТемп
	|ГДЕ
	|	втТемп.АвторИзменения <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("Аукцион", пАукцион);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ответственный");
	
КонецФункции	

Функция НачальныеДанные(пАукцион) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Аук_АукционыНачальныеДанные.Участник КАК Участник,
	|	Аук_АукционыНачальныеДанные.СтрокаНачальныхДанных КАК СтрокаНачальныхДанных,
	|	Аук_АукционыНачальныеДанные.ЭлементНачальныхДанных КАК ЭлементНачальныхДанных,
	|	Аук_АукционыНачальныеДанные.ЗначениеНачальныхДанных КАК ЗначениеНачальныхДанных
	|ИЗ
	|	Справочник.АукАукционы.НачальныеДанные КАК Аук_АукционыНачальныеДанные
	|ГДЕ
	|	Аук_АукционыНачальныеДанные.Ссылка = &Аукцион
	|ИТОГИ ПО
	|	Участник";
	
	Запрос.УстановитьПараметр("Аукцион", пАукцион);
	
	ВыборкаУчастник = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	сооРезультат = Новый Соответствие;
	Пока ВыборкаУчастник.Следующий() Цикл	
		ВыборкаДетальная = ВыборкаУчастник.Выбрать();
		
		масНачДанные = Новый Массив;
		Пока ВыборкаДетальная.Следующий() Цикл
			сткСтрокаТч = Новый Структура("СтрокаНачальныхДанных, ЭлементНачальныхДанных, ЗначениеНачальныхДанных");
			
			ЗаполнитьЗначенияСвойств(сткСтрокаТч, ВыборкаДетальная); 
			
			масНачДанные.Добавить(сткСтрокаТч);	
		КонецЦикла;	
		
		сооРезультат.Вставить(ВыборкаУчастник.Участник, масНачДанные);	
	КонецЦикла;	
	
	Возврат сооРезультат;
	
КонецФункции	

Функция ДанныеАукционаДляПроверки(пАукцион) Экспорт	
	сткРез = КлючевыеДанныеАукциона(пАукцион);
	
	сткРез.Вставить("Этапы",				ЭтапыАукциона(пАукцион));
	сткРез.Вставить("Участники",			УчастникиАукциона(пАукцион));
	сткРез.Вставить("НачальныеДанные",		НачальныеДанные(пАукцион));
	сткРез.Вставить("НастройкиАвтоматики",	НастройкиАвтоматическогоВыполненияАукциона(пАукцион));
	сткРез.Вставить("Параметры",			ПараметрыАукциона(пАукцион, Ложь));
	
	Возврат сткРез;	
КонецФункции	

Функция ПланируемоеВремяЗавершения(пАукцион) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Аук_ИсторияСтатусовАукционовСрезПоследних.Период КАК Период,
	|	Аук_ИсторияСтатусовАукционовСрезПоследних.Аукцион КАК Аукцион
	|ПОМЕСТИТЬ втРеальноеВремяНачала
	|ИЗ
	|	РегистрСведений.АукИсторияСтатусовАукционов.СрезПоследних КАК Аук_ИсторияСтатусовАукционовСрезПоследних
	|ГДЕ
	|	Аук_ИсторияСтатусовАукционовСрезПоследних.Аукцион = &Аукцион
	|	И Аук_ИсторияСтатусовАукционовСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.АукСтатусыАукционов.НовыйЭтап)
	|	И Аук_ИсторияСтатусовАукционовСрезПоследних.НомерЭтапа = 1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АукАукционы.Ссылка КАК Аукцион,
	|	АукАукционы.ДатаНачала КАК ДатаНачала
	|ПОМЕСТИТЬ втПлановоеВремяНачала
	|ИЗ
	|	Справочник.АукАукционы КАК АукАукционы
	|ГДЕ
	|	АукАукционы.Ссылка = &Аукцион
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втПлановоеВремяНачала.Аукцион КАК Аукцион,
	|	ВЫБОР
	|		КОГДА втРеальноеВремяНачала.Период ЕСТЬ NULL
	|			ТОГДА втПлановоеВремяНачала.ДатаНачала
	|		ИНАЧЕ втРеальноеВремяНачала.Период
	|	КОНЕЦ КАК ВремяНачала
	|ПОМЕСТИТЬ втВремяНачала
	|ИЗ
	|	втПлановоеВремяНачала КАК втПлановоеВремяНачала
	|		ЛЕВОЕ СОЕДИНЕНИЕ втРеальноеВремяНачала КАК втРеальноеВремяНачала
	|		ПО втПлановоеВремяНачала.Аукцион = втРеальноеВремяНачала.Аукцион
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втВремяНачала.Аукцион КАК Аукцион,
	|	СУММА(Аук_АукционыЭтапы.ДлительностьДни) КАК ДлительностьДни,
	|	СУММА(РАЗНОСТЬДАТ(ДАТАВРЕМЯ(1, 1, 1), Аук_АукционыЭтапы.ДлительностьЧасы, СЕКУНДА)) КАК ДлительностьСекунды
	|ПОМЕСТИТЬ втДлительность
	|ИЗ
	|	втВремяНачала КАК втВремяНачала
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.АукАукционы.Этапы КАК Аук_АукционыЭтапы
	|		ПО втВремяНачала.Аукцион = Аук_АукционыЭтапы.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	втВремяНачала.Аукцион
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втВремяНачала.Аукцион КАК Аукцион,
	|	ДОБАВИТЬКДАТЕ(втВремяНачала.ВремяНачала, СЕКУНДА, втДлительность.ДлительностьДни * 86400 + втДлительность.ДлительностьСекунды) КАК ВремяЗавершения
	|ИЗ
	|	втВремяНачала КАК втВремяНачала
	|		ЛЕВОЕ СОЕДИНЕНИЕ втДлительность КАК втДлительность
	|		ПО втВремяНачала.Аукцион = втДлительность.Аукцион";
	
	Запрос.УстановитьПараметр("Аукцион", пАукцион);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Выборка.Следующий();
	
	Возврат Выборка.ВремяЗавершения;
КонецФункции	

Функция ПараметрыАукциона(пАукцион, пБулВТаблицуЗначений = Истина) Экспорт
	//сооРезультат = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Аук_АукционыПараметры.Параметр КАК Параметр,
	|	Аук_АукционыПараметры.ЗначениеПараметра КАК ЗначениеПараметра,
	|	АукЭлементыДанныхАукционов.ТипЗначения КАК ТипЗначения
	|ИЗ
	|	Справочник.АукАукционы.Параметры КАК Аук_АукционыПараметры
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.АукЭлементыДанныхАукционов КАК АукЭлементыДанныхАукционов
	|		ПО Аук_АукционыПараметры.Параметр = АукЭлементыДанныхАукционов.Ссылка
	|ГДЕ
	|	Аук_АукционыПараметры.Ссылка = &Аукцион";
	
	Запрос.УстановитьПараметр("Аукцион", пАукцион);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если пБулВТаблицуЗначений Тогда 	
		Возврат РезультатЗапроса.Выгрузить();	
	Иначе
		Возврат ЭдоОбщийСервер.РезультатЗапросаВМассивСтруктур(РезультатЗапроса);
	КонецЕсли;
КонецФункции	

#КонецОбласти

#Область АукционыОжидающиеДействияПриРаботеВАвтоматическомРежиме

// Аукционы, ожидающие старта
//    Критерии:
//		1. Текущая дата > даты начала (реквизит "ДатаНачала" спр АукАукционы)
//		2. Статус = Перечисление.АукСтатусыАукционов.Новый
//		3. Нет ранее созданных но невыполненных команд ПроверитьВозможностьНачалаАукциона И НачатьАукцион
//			(т.е. Результат = Перечисление.АукРезультатыВыполненияКоманд.ПустаяСсылка) 
//		4.1 Аукционы с автоматическим стартом (реквизит АвтоматическийСтарт = Истина) отбираются в любом случае при выполнении условий 1, 2 и 3
//		4.2 Аукционы с ручным стартом (реквизит АвтоматическийСтарт = Истина) отбираются при выполнении условий 1, 2 и 3,
//		И доп. условий:
//			а) по команде было не более 2-х оповещений сотрудников;
//			б) последнее оповещение было более 15 минут назад 
//
Функция АукционыОжидающиеДействия_НачатьАукцион(пТекДата = Неопределено) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АукАукционы.Ссылка КАК Аукцион,
	|	АукАукционы.АвтоматическийСтарт КАК АвтоматическийСтарт,
	|	ЗНАЧЕНИЕ(Перечисление.АукКоманды.АвтоПроверкаНачатьАукцион) КАК Команда
	|ПОМЕСТИТЬ втАукционы
	|ИЗ
	|	Справочник.АукАукционы КАК АукАукционы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АукИсторияСтатусовАукционов.СрезПоследних КАК Аук_ИсторияСтатусовАукционовСрезПоследних
	|		ПО АукАукционы.Ссылка = Аук_ИсторияСтатусовАукционовСрезПоследних.Аукцион
	|			И (Аук_ИсторияСтатусовАукционовСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.АукСтатусыАукционов.Новый))
	|ГДЕ
	|	АукАукционы.ДатаНачала < &ТекДата
	|	И НЕ АукАукционы.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втАукционы.Аукцион КАК Аукцион,
	|	втАукционы.Команда КАК Команда,
	|	втАукционы.АвтоматическийСтарт КАК АвтоматическийСтарт,
	|	АукИсторияКомандАукционов.Результат КАК Результат,
	|	АукИсторияКомандАукционов.КлючКоманды КАК КлючКоманды
	|ПОМЕСТИТЬ втИсторияВыполнения
	|ИЗ
	|	втАукционы КАК втАукционы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АукИсторияКомандАукционов КАК АукИсторияКомандАукционов
	|		ПО втАукционы.Аукцион = АукИсторияКомандАукционов.Аукцион
	|			И (АукИсторияКомандАукционов.Команда В (ЗНАЧЕНИЕ(Перечисление.АукКоманды.АвтоПроверкаНачатьАукцион), ЗНАЧЕНИЕ(Перечисление.АукКоманды.НачатьАукцион)))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втИсторияВыполнения.Аукцион КАК Аукцион,
	|	МАКСИМУМ(АукИсторияКомандАукционов.Период) КАК ПоследнееОповещение,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ АукИсторияКомандАукционов.КлючРодителя) КАК КоличествоОповещений
	|ПОМЕСТИТЬ втИсторияВыполненияОповещенийПоКоманде
	|ИЗ
	|	втИсторияВыполнения КАК втИсторияВыполнения
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АукИсторияКомандАукционов КАК АукИсторияКомандАукционов
	|		ПО втИсторияВыполнения.Аукцион = АукИсторияКомандАукционов.Аукцион
	|			И втИсторияВыполнения.КлючКоманды = АукИсторияКомандАукционов.КлючРодителя
	|			И (АукИсторияКомандАукционов.Команда = ЗНАЧЕНИЕ(Перечисление.АукКоманды.ОтправитьСообщениеАвтору))
	|ГДЕ
	|	НЕ втИсторияВыполнения.АвтоматическийСтарт
	|
	|СГРУППИРОВАТЬ ПО
	|	втИсторияВыполнения.Аукцион
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втАукционы.Аукцион КАК Аукцион,
	|	втАукционы.Команда КАК Команда
	|ИЗ
	|	втАукционы КАК втАукционы
	|		ЛЕВОЕ СОЕДИНЕНИЕ втИсторияВыполнения КАК втИсторияВыполнения
	|		ПО втАукционы.Аукцион = втИсторияВыполнения.Аукцион
	|			И втАукционы.Команда = втИсторияВыполнения.Команда
	|ГДЕ
	|	втИсторияВыполнения.Аукцион ЕСТЬ NULL
	|	И втАукционы.АвтоматическийСтарт
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	втАукционы.Аукцион,
	|	втАукционы.Команда
	|ИЗ
	|	втАукционы КАК втАукционы
	|		ЛЕВОЕ СОЕДИНЕНИЕ втИсторияВыполнения КАК втИсторияВыполнения
	|		ПО втАукционы.Аукцион = втИсторияВыполнения.Аукцион
	|			И втАукционы.Команда = втИсторияВыполнения.Команда
	|			И (втИсторияВыполнения.Результат = ЗНАЧЕНИЕ(Перечисление.АукРезультатыВыполненияКоманд.ПустаяСсылка))
	|		ЛЕВОЕ СОЕДИНЕНИЕ втИсторияВыполненияОповещенийПоКоманде КАК втИсторияВыполненияОповещенийПоКоманде
	|		ПО втАукционы.Аукцион = втИсторияВыполненияОповещенийПоКоманде.Аукцион
	|ГДЕ
	|	втИсторияВыполнения.Аукцион ЕСТЬ NULL
	|	И НЕ втАукционы.АвтоматическийСтарт
	|	И ЕСТЬNULL(втИсторияВыполненияОповещенийПоКоманде.КоличествоОповещений, 0) < &МаксКоличествоОповещений
	|	И РАЗНОСТЬДАТ(ЕСТЬNULL(втИсторияВыполненияОповещенийПоКоманде.ПоследнееОповещение, ДАТАВРЕМЯ(1, 1, 1)), &ТекДата, МИНУТА) > &ДельтаМеждуОповещениями";
	
	Запрос.УстановитьПараметр("ТекДата",		?(пТекДата <> Неопределено, пТекДата, ОбщегоНазначенияВызовСервера.ТекущаяДатаСервер_()));
	Запрос.УстановитьПараметр("МаксКоличествоОповещений",		АукУправлениеАукционамиКлиентСервер.КоличествоСлужебныхОповещений());
	Запрос.УстановитьПараметр("ДельтаМеждуОповещениями",		АукУправлениеАукционамиКлиентСервер.ПромежутокВремениМеждуОповещениямиМинут());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат ЭдоОбщийСервер.РезультатЗапросаВМассивСтруктур(РезультатЗапроса);
	
КонецФункции	

// Аукционы, ожидающие перехода к подведению промежуточных итогов (является аналогом АукционыОжидающиеДействия_ПерейтиКПодведениюИтогов, кроме критерия 2)
//    Критерии:
//		1. К дате последнего статуса "НовыйЭтап" прибавляется длительность этапа, текущая дата должна быть больше
//		2. Статус = Перечисление.АукСтатусыАукционов.НовыйЭтап
//		2. Текущий этап непоследний
//		4. Нет ранее созданных но невыполненных команд ПроверитьВозможностьПеревестиАукционНаСледующийЭтап И ПеревестиАукционНаСледующийЭтап
//			(т.е. Результат = Перечисление.АукРезультатыВыполненияКоманд.ПустаяСсылка) 
//		5.1 Аукционы с автоматическим стартом (реквизит АвтоматическийПереходКПодведениюПромежуточныхИтогов = Истина) отбираются в любом случае при выполнении условий 1, 2 и 3
//		5.2 Аукционы с ручным стартом (реквизит АвтоматическийПереходКПодведениюПромежуточныхИтогов = Истина) отбираются при выполнении условий 1, 2 и 3,
//		И доп. условий:
//			а) по команде было не более 2-х оповещений сотрудников. Причем счет ведется от последнего статуса (их может быть несколько);
//			б) последнее оповещение было более 15 минут назад 
//
Функция АукционыОжидающиеДействия_ПерейтиКПодведениюПромежуточныхИтогов(пТекДата = Неопределено) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АукАукционы.Ссылка КАК Аукцион,
	|	АукАукционы.АвтоматическийПереходКПодведениюПромежуточныхИтогов КАК АвтоматическийПереходКПодведениюПромежуточныхИтогов,
	|	ЗНАЧЕНИЕ(Перечисление.АукКоманды.АвтоПроверкаПерейтиКПодведениюПромежуточныхИтогов) КАК Команда,
	|	Аук_ИсторияСтатусовАукционовСрезПоследних.Период КАК Период,
	|	Аук_ИсторияСтатусовАукционовСрезПоследних.НомерЭтапа КАК НомерЭтапа
	|ПОМЕСТИТЬ втАукционы
	|ИЗ
	|	Справочник.АукАукционы КАК АукАукционы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АукИсторияСтатусовАукционов.СрезПоследних(, ) КАК Аук_ИсторияСтатусовАукционовСрезПоследних
	|		ПО АукАукционы.Ссылка = Аук_ИсторияСтатусовАукционовСрезПоследних.Аукцион
	|			И (Аук_ИсторияСтатусовАукционовСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.АукСтатусыАукционов.НовыйЭтап))
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.АукАукционы.Этапы КАК Аук_АукционыЭтапы
	|		ПО АукАукционы.Ссылка = Аук_АукционыЭтапы.Ссылка
	|			И (Аук_ИсторияСтатусовАукционовСрезПоследних.НомерЭтапа = Аук_АукционыЭтапы.НомерСтроки)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			Аук_АукционыЭтапы.Ссылка КАК Аукцион,
	|			МАКСИМУМ(Аук_АукционыЭтапы.НомерСтроки) КАК МаксНомерЭтапа
	|		ИЗ
	|			Справочник.АукАукционы.Этапы КАК Аук_АукционыЭтапы
	|		
	|		СГРУППИРОВАТЬ ПО
	|			Аук_АукционыЭтапы.Ссылка) КАК ВложенныйЗапрос
	|		ПО АукАукционы.Ссылка = ВложенныйЗапрос.Аукцион
	|			И (Аук_ИсторияСтатусовАукционовСрезПоследних.НомерЭтапа < ВложенныйЗапрос.МаксНомерЭтапа)
	|ГДЕ
	|	ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(Аук_ИсторияСтатусовАукционовСрезПоследних.Период, ДЕНЬ, Аук_АукционыЭтапы.ДлительностьДни), СЕКУНДА, РАЗНОСТЬДАТ(ДАТАВРЕМЯ(1, 1, 1), Аук_АукционыЭтапы.ДлительностьЧасы, СЕКУНДА)) < &ТекДата
	|	И НЕ АукАукционы.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втАукционы.Аукцион КАК Аукцион,
	|	втАукционы.Команда КАК Команда,
	|	втАукционы.АвтоматическийПереходКПодведениюПромежуточныхИтогов КАК АвтоматическийПереходКПодведениюПромежуточныхИтогов,
	|	АукИсторияКомандАукционов.Результат КАК Результат,
	|	АукИсторияКомандАукционов.КлючКоманды КАК КлючКоманды
	|ПОМЕСТИТЬ втИсторияВыполнения
	|ИЗ
	|	втАукционы КАК втАукционы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АукИсторияКомандАукционов КАК АукИсторияКомандАукционов
	|		ПО втАукционы.Аукцион = АукИсторияКомандАукционов.Аукцион
	|			И втАукционы.Период <= АукИсторияКомандАукционов.Период
	|			И (АукИсторияКомандАукционов.Команда В (ЗНАЧЕНИЕ(Перечисление.АукКоманды.АвтоПроверкаПерейтиКПодведениюПромежуточныхИтогов), ЗНАЧЕНИЕ(Перечисление.АукКоманды.ПерейтиКПодведениюПромежуточныхИтогов)))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втИсторияВыполнения.Аукцион КАК Аукцион,
	|	МАКСИМУМ(АукИсторияКомандАукционов.Период) КАК ПоследнееОповещение,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ АукИсторияКомандАукционов.КлючРодителя) КАК КоличествоОповещений
	|ПОМЕСТИТЬ втИсторияВыполненияОповещенийПоКоманде
	|ИЗ
	|	втИсторияВыполнения КАК втИсторияВыполнения
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АукИсторияКомандАукционов КАК АукИсторияКомандАукционов
	|		ПО втИсторияВыполнения.Аукцион = АукИсторияКомандАукционов.Аукцион
	|			И втИсторияВыполнения.КлючКоманды = АукИсторияКомандАукционов.КлючРодителя
	|			И (АукИсторияКомандАукционов.Команда = ЗНАЧЕНИЕ(Перечисление.АукКоманды.ОтправитьСообщениеАвтору))
	|ГДЕ
	|	НЕ втИсторияВыполнения.АвтоматическийПереходКПодведениюПромежуточныхИтогов
	|
	|СГРУППИРОВАТЬ ПО
	|	втИсторияВыполнения.Аукцион
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втАукционы.Аукцион КАК Аукцион,
	|	втАукционы.НомерЭтапа КАК НомерЭтапа,
	|	втАукционы.Команда КАК Команда
	|ИЗ
	|	втАукционы КАК втАукционы
	|		ЛЕВОЕ СОЕДИНЕНИЕ втИсторияВыполнения КАК втИсторияВыполнения
	|		ПО втАукционы.Аукцион = втИсторияВыполнения.Аукцион
	|			И втАукционы.Команда = втИсторияВыполнения.Команда
	|ГДЕ
	|	втИсторияВыполнения.Аукцион ЕСТЬ NULL
	|	И втАукционы.АвтоматическийПереходКПодведениюПромежуточныхИтогов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	втАукционы.Аукцион,
	|	втАукционы.НомерЭтапа КАК НомерЭтапа,
	|	втАукционы.Команда
	|ИЗ
	|	втАукционы КАК втАукционы
	|		ЛЕВОЕ СОЕДИНЕНИЕ втИсторияВыполнения КАК втИсторияВыполнения
	|		ПО втАукционы.Аукцион = втИсторияВыполнения.Аукцион
	|			И втАукционы.Команда = втИсторияВыполнения.Команда
	|			И (втИсторияВыполнения.Результат = ЗНАЧЕНИЕ(Перечисление.АукРезультатыВыполненияКоманд.ПустаяСсылка))
	|		ЛЕВОЕ СОЕДИНЕНИЕ втИсторияВыполненияОповещенийПоКоманде КАК втИсторияВыполненияОповещенийПоКоманде
	|		ПО втАукционы.Аукцион = втИсторияВыполненияОповещенийПоКоманде.Аукцион
	|ГДЕ
	|	втИсторияВыполнения.Аукцион ЕСТЬ NULL
	|	И НЕ втАукционы.АвтоматическийПереходКПодведениюПромежуточныхИтогов
	|	И ЕСТЬNULL(втИсторияВыполненияОповещенийПоКоманде.КоличествоОповещений, 0) < &МаксКоличествоОповещений
	|	И РАЗНОСТЬДАТ(ЕСТЬNULL(втИсторияВыполненияОповещенийПоКоманде.ПоследнееОповещение, ДАТАВРЕМЯ(1, 1, 1)), &ТекДата, МИНУТА) > &ДельтаМеждуОповещениями";
	
	Запрос.УстановитьПараметр("ТекДата",		?(пТекДата <> Неопределено, пТекДата, ОбщегоНазначенияВызовСервера.ТекущаяДатаСервер_()));
	Запрос.УстановитьПараметр("МаксКоличествоОповещений",	АукУправлениеАукционамиКлиентСервер.КоличествоСлужебныхОповещений());
	Запрос.УстановитьПараметр("ДельтаМеждуОповещениями",	АукУправлениеАукционамиКлиентСервер.ПромежутокВремениМеждуОповещениямиМинут());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат ЭдоОбщийСервер.РезультатЗапросаВМассивСтруктур(РезультатЗапроса);
	
КонецФункции

// Аукционы, ожидающие подведения промежуточных итогов
//    Критерии:
//		1. Статус = Перечисление.АукСтатусыАукционов.ПодведениеПромежуточныхИтогов
//		2. Нет ранее созданных но невыполненных команд АвтоматическоеПодведениеПромежуточныхИтогов И ЗафиксироватьПромежуточныеИтогиАукциона
//			(т.е. Результат = Перечисление.АукРезультатыВыполненияКоманд.ПустаяСсылка) 
//		3.1 Аукционы с автоматическим стартом (реквизит ПроверитьВозможностьПодведенияПромежуточныхИтогов = Истина) отбираются в любом случае при выполнении условий 1 и 2
//		3.2 Аукционы с ручным стартом (реквизит ПроверитьВозможностьПодведенияПромежуточныхИтогов = Истина) отбираются при выполнении условий 1 и 2,
//		И доп. условий:
//			а) по команде было не более 2-х оповещений сотрудников. Причем счет ведется от последнего статуса (их может быть несколько);
//			б) последнее оповещение было более 15 минут назад 
//
Функция АукционыОжидающиеДействия_ПодвестиПромежуточныеИтоги(пТекДата = Неопределено) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АукАукционы.Ссылка КАК Аукцион,
	|	АукАукционы.АвтоматическоеПодведениеПромежуточныхИтогов КАК АвтоматическоеПодведениеПромежуточныхИтогов,
	|	ЗНАЧЕНИЕ(Перечисление.АукКоманды.АвтоПроверкаПодвестиПромежуточныеИтоги) КАК Команда,
	|	Аук_ИсторияСтатусовАукционовСрезПоследних.Период КАК Период,
	|	Аук_ИсторияСтатусовАукционовСрезПоследних.НомерЭтапа КАК НомерЭтапа
	|ПОМЕСТИТЬ втАукционы
	|ИЗ
	|	Справочник.АукАукционы КАК АукАукционы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АукИсторияСтатусовАукционов.СрезПоследних КАК Аук_ИсторияСтатусовАукционовСрезПоследних
	|		ПО АукАукционы.Ссылка = Аук_ИсторияСтатусовАукционовСрезПоследних.Аукцион
	|			И (Аук_ИсторияСтатусовАукционовСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.АукСтатусыАукционов.ПодведениеПромежуточныхИтогов))
	|ГДЕ
	|	НЕ АукАукционы.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втАукционы.Аукцион КАК Аукцион,
	|	втАукционы.Команда КАК Команда,
	|	втАукционы.АвтоматическоеПодведениеПромежуточныхИтогов КАК АвтоматическоеПодведениеПромежуточныхИтогов,
	|	АукИсторияКомандАукционов.Результат КАК Результат,
	|	АукИсторияКомандАукционов.КлючКоманды КАК КлючКоманды
	|ПОМЕСТИТЬ втИсторияВыполнения
	|ИЗ
	|	втАукционы КАК втАукционы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АукИсторияКомандАукционов КАК АукИсторияКомандАукционов
	|		ПО втАукционы.Аукцион = АукИсторияКомандАукционов.Аукцион
	|			И втАукционы.Период <= АукИсторияКомандАукционов.Период
	|			И (АукИсторияКомандАукционов.Команда В (ЗНАЧЕНИЕ(Перечисление.АукКоманды.АвтоПроверкаПодвестиПромежуточныеИтоги), ЗНАЧЕНИЕ(Перечисление.АукКоманды.ЗафиксироватьПромежуточныеИтоги)))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втИсторияВыполнения.Аукцион КАК Аукцион,
	|	МАКСИМУМ(АукИсторияКомандАукционов.Период) КАК ПоследнееОповещение,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ АукИсторияКомандАукционов.КлючРодителя) КАК КоличествоОповещений
	|ПОМЕСТИТЬ втИсторияВыполненияОповещенийПоКоманде
	|ИЗ
	|	втИсторияВыполнения КАК втИсторияВыполнения
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АукИсторияКомандАукционов КАК АукИсторияКомандАукционов
	|		ПО втИсторияВыполнения.Аукцион = АукИсторияКомандАукционов.Аукцион
	|			И втИсторияВыполнения.КлючКоманды = АукИсторияКомандАукционов.КлючРодителя
	|			И (АукИсторияКомандАукционов.Команда = ЗНАЧЕНИЕ(Перечисление.АукКоманды.ОтправитьСообщениеАвтору))
	|ГДЕ
	|	НЕ втИсторияВыполнения.АвтоматическоеПодведениеПромежуточныхИтогов
	|
	|СГРУППИРОВАТЬ ПО
	|	втИсторияВыполнения.Аукцион
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втАукционы.Аукцион КАК Аукцион,
	|	втАукционы.НомерЭтапа КАК НомерЭтапа,
	|	втАукционы.Команда КАК Команда
	|ИЗ
	|	втАукционы КАК втАукционы
	|		ЛЕВОЕ СОЕДИНЕНИЕ втИсторияВыполнения КАК втИсторияВыполнения
	|		ПО втАукционы.Аукцион = втИсторияВыполнения.Аукцион
	|			И втАукционы.Команда = втИсторияВыполнения.Команда
	|ГДЕ
	|	втИсторияВыполнения.Аукцион ЕСТЬ NULL
	|	И втАукционы.АвтоматическоеПодведениеПромежуточныхИтогов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	втАукционы.Аукцион,
	|	втАукционы.НомерЭтапа КАК НомерЭтапа,
	|	втАукционы.Команда
	|ИЗ
	|	втАукционы КАК втАукционы
	|		ЛЕВОЕ СОЕДИНЕНИЕ втИсторияВыполнения КАК втИсторияВыполнения
	|		ПО втАукционы.Аукцион = втИсторияВыполнения.Аукцион
	|			И втАукционы.Команда = втИсторияВыполнения.Команда
	|			И (втИсторияВыполнения.Результат = ЗНАЧЕНИЕ(Перечисление.АукРезультатыВыполненияКоманд.ПустаяСсылка))
	|		ЛЕВОЕ СОЕДИНЕНИЕ втИсторияВыполненияОповещенийПоКоманде КАК втИсторияВыполненияОповещенийПоКоманде
	|		ПО втАукционы.Аукцион = втИсторияВыполненияОповещенийПоКоманде.Аукцион
	|ГДЕ
	|	втИсторияВыполнения.Аукцион ЕСТЬ NULL
	|	И НЕ втАукционы.АвтоматическоеПодведениеПромежуточныхИтогов
	|	И ЕСТЬNULL(втИсторияВыполненияОповещенийПоКоманде.КоличествоОповещений, 0) < &МаксКоличествоОповещений
	|	И РАЗНОСТЬДАТ(ЕСТЬNULL(втИсторияВыполненияОповещенийПоКоманде.ПоследнееОповещение, ДАТАВРЕМЯ(1, 1, 1)), &ТекДата, МИНУТА) > &ДельтаМеждуОповещениями";
	
	Запрос.УстановитьПараметр("ТекДата",		?(пТекДата <> Неопределено, пТекДата, ОбщегоНазначенияВызовСервера.ТекущаяДатаСервер_()));
	Запрос.УстановитьПараметр("МаксКоличествоОповещений",	АукУправлениеАукционамиКлиентСервер.КоличествоСлужебныхОповещений());
	Запрос.УстановитьПараметр("ДельтаМеждуОповещениями",	АукУправлениеАукционамиКлиентСервер.ПромежутокВремениМеждуОповещениямиМинут());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат ЭдоОбщийСервер.РезультатЗапросаВМассивСтруктур(РезультатЗапроса);
	
КонецФункции

// Аукционы, ожидающие перехода к подведению итогов (является аналогом АукционыОжидающиеДействия_ПерейтиКПодведениюПромежуточныхИтогов, кроме критерия 2)
//    Критерии:
//		1. К дате последнего статуса "НовыйЭтап" прибавляется длительность этапа, текущая дата должна быть больше
//		2. Статус = Перечисление.АукСтатусыАукционов.НовыйЭтап
//		2. Текущий этап последний
//		4. Нет ранее созданных но невыполненных команд ПроверитьВозможностьПеревестиАукционНаСледующийЭтап И ПеревестиАукционНаСледующийЭтап
//			(т.е. Результат = Перечисление.АукРезультатыВыполненияКоманд.ПустаяСсылка) 
//		5.1 Аукционы с автоматическим стартом (реквизит АвтоматическийПереходКПодведениюОкончательныхИтогов = Истина) отбираются в любом случае при выполнении условий 1, 2 и 3
//		5.2 Аукционы с ручным стартом (реквизит АвтоматическийПереходКПодведениюОкончательныхИтогов = Истина) отбираются при выполнении условий 1, 2 и 3,
//		И доп. условий:
//			а) по команде было не более 2-х оповещений сотрудников. Причем счет ведется от последнего статуса (их может быть несколько);
//			б) последнее оповещение было более 15 минут назад 
//
Функция АукционыОжидающиеДействия_ПерейтиКПодведениюИтогов(пТекДата = Неопределено) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АукАукционы.Ссылка КАК Аукцион,
	|	АукАукционы.АвтоматическийПереходКПодведениюОкончательныхИтогов КАК АвтоматическийПереходКПодведениюОкончательныхИтогов,
	|	ЗНАЧЕНИЕ(Перечисление.АукКоманды.АвтоПроверкаПерейтиКПодведениюИтогов) КАК Команда,
	|	Аук_ИсторияСтатусовАукционовСрезПоследних.Период КАК Период,
	|	Аук_ИсторияСтатусовАукционовСрезПоследних.НомерЭтапа КАК НомерЭтапа
	|ПОМЕСТИТЬ втАукционы
	|ИЗ
	|	Справочник.АукАукционы КАК АукАукционы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АукИсторияСтатусовАукционов.СрезПоследних(, ) КАК Аук_ИсторияСтатусовАукционовСрезПоследних
	|		ПО АукАукционы.Ссылка = Аук_ИсторияСтатусовАукционовСрезПоследних.Аукцион
	|			И (Аук_ИсторияСтатусовАукционовСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.АукСтатусыАукционов.НовыйЭтап))
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.АукАукционы.Этапы КАК Аук_АукционыЭтапы
	|		ПО АукАукционы.Ссылка = Аук_АукционыЭтапы.Ссылка
	|			И (Аук_ИсторияСтатусовАукционовСрезПоследних.НомерЭтапа = Аук_АукционыЭтапы.НомерСтроки)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			Аук_АукционыЭтапы.Ссылка КАК Аукцион,
	|			МАКСИМУМ(Аук_АукционыЭтапы.НомерСтроки) КАК МаксНомерЭтапа
	|		ИЗ
	|			Справочник.АукАукционы.Этапы КАК Аук_АукционыЭтапы
	|		
	|		СГРУППИРОВАТЬ ПО
	|			Аук_АукционыЭтапы.Ссылка) КАК ВложенныйЗапрос
	|		ПО АукАукционы.Ссылка = ВложенныйЗапрос.Аукцион
	|			И (Аук_ИсторияСтатусовАукционовСрезПоследних.НомерЭтапа = ВложенныйЗапрос.МаксНомерЭтапа)
	|ГДЕ
	|	ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(Аук_ИсторияСтатусовАукционовСрезПоследних.Период, ДЕНЬ, Аук_АукционыЭтапы.ДлительностьДни), СЕКУНДА, РАЗНОСТЬДАТ(ДАТАВРЕМЯ(1, 1, 1), Аук_АукционыЭтапы.ДлительностьЧасы, СЕКУНДА)) < &ТекДата
	|	И НЕ АукАукционы.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втАукционы.Аукцион КАК Аукцион,
	|	втАукционы.Команда КАК Команда,
	|	втАукционы.АвтоматическийПереходКПодведениюОкончательныхИтогов КАК АвтоматическийПереходКПодведениюОкончательныхИтогов,
	|	АукИсторияКомандАукционов.Результат КАК Результат,
	|	АукИсторияКомандАукционов.КлючКоманды КАК КлючКоманды
	|ПОМЕСТИТЬ втИсторияВыполнения
	|ИЗ
	|	втАукционы КАК втАукционы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АукИсторияКомандАукционов КАК АукИсторияКомандАукционов
	|		ПО втАукционы.Аукцион = АукИсторияКомандАукционов.Аукцион
	|			И втАукционы.Период <= АукИсторияКомандАукционов.Период
	|			И (АукИсторияКомандАукционов.Команда В (ЗНАЧЕНИЕ(Перечисление.АукКоманды.АвтоПроверкаПерейтиКПодведениюИтогов), ЗНАЧЕНИЕ(Перечисление.АукКоманды.ПерейтиКПодведениюИтогов)))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втИсторияВыполнения.Аукцион КАК Аукцион,
	|	МАКСИМУМ(АукИсторияКомандАукционов.Период) КАК ПоследнееОповещение,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ АукИсторияКомандАукционов.КлючРодителя) КАК КоличествоОповещений
	|ПОМЕСТИТЬ втИсторияВыполненияОповещенийПоКоманде
	|ИЗ
	|	втИсторияВыполнения КАК втИсторияВыполнения
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АукИсторияКомандАукционов КАК АукИсторияКомандАукционов
	|		ПО втИсторияВыполнения.Аукцион = АукИсторияКомандАукционов.Аукцион
	|			И втИсторияВыполнения.КлючКоманды = АукИсторияКомандАукционов.КлючРодителя
	|			И (АукИсторияКомандАукционов.Команда = ЗНАЧЕНИЕ(Перечисление.АукКоманды.ОтправитьСообщениеАвтору))
	|ГДЕ
	|	НЕ втИсторияВыполнения.АвтоматическийПереходКПодведениюОкончательныхИтогов
	|
	|СГРУППИРОВАТЬ ПО
	|	втИсторияВыполнения.Аукцион
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втАукционы.Аукцион КАК Аукцион,
	|	втАукционы.НомерЭтапа КАК НомерЭтапа,
	|	втАукционы.Команда КАК Команда
	|ИЗ
	|	втАукционы КАК втАукционы
	|		ЛЕВОЕ СОЕДИНЕНИЕ втИсторияВыполнения КАК втИсторияВыполнения
	|		ПО втАукционы.Аукцион = втИсторияВыполнения.Аукцион
	|			И втАукционы.Команда = втИсторияВыполнения.Команда
	|ГДЕ
	|	втИсторияВыполнения.Аукцион ЕСТЬ NULL
	|	И втАукционы.АвтоматическийПереходКПодведениюОкончательныхИтогов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	втАукционы.Аукцион,
	|	втАукционы.НомерЭтапа КАК НомерЭтапа,
	|	втАукционы.Команда
	|ИЗ
	|	втАукционы КАК втАукционы
	|		ЛЕВОЕ СОЕДИНЕНИЕ втИсторияВыполнения КАК втИсторияВыполнения
	|		ПО втАукционы.Аукцион = втИсторияВыполнения.Аукцион
	|			И втАукционы.Команда = втИсторияВыполнения.Команда
	|			И (втИсторияВыполнения.Результат = ЗНАЧЕНИЕ(Перечисление.АукРезультатыВыполненияКоманд.ПустаяСсылка))
	|		ЛЕВОЕ СОЕДИНЕНИЕ втИсторияВыполненияОповещенийПоКоманде КАК втИсторияВыполненияОповещенийПоКоманде
	|		ПО втАукционы.Аукцион = втИсторияВыполненияОповещенийПоКоманде.Аукцион
	|ГДЕ
	|	втИсторияВыполнения.Аукцион ЕСТЬ NULL
	|	И НЕ втАукционы.АвтоматическийПереходКПодведениюОкончательныхИтогов
	|	И ЕСТЬNULL(втИсторияВыполненияОповещенийПоКоманде.КоличествоОповещений, 0) < &МаксКоличествоОповещений
	|	И РАЗНОСТЬДАТ(ЕСТЬNULL(втИсторияВыполненияОповещенийПоКоманде.ПоследнееОповещение, ДАТАВРЕМЯ(1, 1, 1)), &ТекДата, МИНУТА) > &ДельтаМеждуОповещениями";
	
	Запрос.УстановитьПараметр("ТекДата",		?(пТекДата <> Неопределено, пТекДата, ОбщегоНазначенияВызовСервера.ТекущаяДатаСервер_()));
	Запрос.УстановитьПараметр("МаксКоличествоОповещений",	АукУправлениеАукционамиКлиентСервер.КоличествоСлужебныхОповещений());
	Запрос.УстановитьПараметр("ДельтаМеждуОповещениями",	АукУправлениеАукционамиКлиентСервер.ПромежутокВремениМеждуОповещениямиМинут());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат ЭдоОбщийСервер.РезультатЗапросаВМассивСтруктур(РезультатЗапроса);
	
КонецФункции

// Аукционы, ожидающие подведения окончательных итогов
//    Критерии:
//		1. Статус = Перечисление.АукСтатусыАукционов.ПодведениеИтогов
//		2. Нет ранее созданных но невыполненных команд ПроверитьВозможностьЗавершенияАукциона И ЗавершитьАукцион
//			(т.е. Результат = Перечисление.АукРезультатыВыполненияКоманд.ПустаяСсылка) 
//		3.1 Аукционы с автоматическим стартом (реквизит АвтоматическоеПодведениеОкончательныхИтогов = Истина) отбираются в любом случае при выполнении условий 1 и 2
//		3.2 Аукционы с ручным стартом (реквизит АвтоматическоеПодведениеОкончательныхИтогов = Истина) отбираются при выполнении условий 1 и 2,
//		И доп. условий:
//			а) по команде было не более 2-х оповещений сотрудников;
//			б) последнее оповещение было более 15 минут назад 
//
Функция АукционыОжидающиеДействия_ПодвестиИтогиАукциона(пТекДата = Неопределено) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АукАукционы.Ссылка КАК Аукцион,
	|	АукАукционы.АвтоматическоеПодведениеОкончательныхИтогов КАК АвтоматическоеПодведениеОкончательныхИтогов,
	|	ЗНАЧЕНИЕ(Перечисление.АукКоманды.АвтоПроверкаПодвестиИтогиАукциона) КАК Команда,
	|	Аук_ИсторияСтатусовАукционовСрезПоследних.НомерЭтапа КАК НомерЭтапа
	|ПОМЕСТИТЬ втАукционы
	|ИЗ
	|	Справочник.АукАукционы КАК АукАукционы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АукИсторияСтатусовАукционов.СрезПоследних КАК Аук_ИсторияСтатусовАукционовСрезПоследних
	|		ПО АукАукционы.Ссылка = Аук_ИсторияСтатусовАукционовСрезПоследних.Аукцион
	|			И (Аук_ИсторияСтатусовАукционовСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.АукСтатусыАукционов.ПодведениеИтогов))
	|ГДЕ
	|	НЕ АукАукционы.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втАукционы.Аукцион КАК Аукцион,
	|	втАукционы.Команда КАК Команда,
	|	втАукционы.АвтоматическоеПодведениеОкончательныхИтогов КАК АвтоматическоеПодведениеОкончательныхИтогов,
	|	АукИсторияКомандАукционов.Результат КАК Результат,
	|	АукИсторияКомандАукционов.КлючКоманды КАК КлючКоманды
	|ПОМЕСТИТЬ втИсторияВыполнения
	|ИЗ
	|	втАукционы КАК втАукционы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АукИсторияКомандАукционов КАК АукИсторияКомандАукционов
	|		ПО втАукционы.Аукцион = АукИсторияКомандАукционов.Аукцион
	|			И (АукИсторияКомандАукционов.Команда В (ЗНАЧЕНИЕ(Перечисление.АукКоманды.АвтоПроверкаПодвестиИтогиАукциона), ЗНАЧЕНИЕ(Перечисление.АукКоманды.ЗафиксироватьИтогиАукциона)))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втИсторияВыполнения.Аукцион КАК Аукцион,
	|	МАКСИМУМ(АукИсторияКомандАукционов.Период) КАК ПоследнееОповещение,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ АукИсторияКомандАукционов.КлючРодителя) КАК КоличествоОповещений
	|ПОМЕСТИТЬ втИсторияВыполненияОповещенийПоКоманде
	|ИЗ
	|	втИсторияВыполнения КАК втИсторияВыполнения
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АукИсторияКомандАукционов КАК АукИсторияКомандАукционов
	|		ПО втИсторияВыполнения.Аукцион = АукИсторияКомандАукционов.Аукцион
	|			И втИсторияВыполнения.КлючКоманды = АукИсторияКомандАукционов.КлючРодителя
	|			И (АукИсторияКомандАукционов.Команда = ЗНАЧЕНИЕ(Перечисление.АукКоманды.ОтправитьСообщениеАвтору))
	|ГДЕ
	|	НЕ втИсторияВыполнения.АвтоматическоеПодведениеОкончательныхИтогов
	|
	|СГРУППИРОВАТЬ ПО
	|	втИсторияВыполнения.Аукцион
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втАукционы.Аукцион КАК Аукцион,
	|	втАукционы.НомерЭтапа КАК НомерЭтапа,
	|	втАукционы.Команда КАК Команда
	|ИЗ
	|	втАукционы КАК втАукционы
	|		ЛЕВОЕ СОЕДИНЕНИЕ втИсторияВыполнения КАК втИсторияВыполнения
	|		ПО втАукционы.Аукцион = втИсторияВыполнения.Аукцион
	|			И втАукционы.Команда = втИсторияВыполнения.Команда
	|ГДЕ
	|	втИсторияВыполнения.Аукцион ЕСТЬ NULL
	|	И втАукционы.АвтоматическоеПодведениеОкончательныхИтогов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	втАукционы.Аукцион,
	|	втАукционы.НомерЭтапа КАК НомерЭтапа,
	|	втАукционы.Команда
	|ИЗ
	|	втАукционы КАК втАукционы
	|		ЛЕВОЕ СОЕДИНЕНИЕ втИсторияВыполнения КАК втИсторияВыполнения
	|		ПО втАукционы.Аукцион = втИсторияВыполнения.Аукцион
	|			И втАукционы.Команда = втИсторияВыполнения.Команда
	|			И (втИсторияВыполнения.Результат = ЗНАЧЕНИЕ(Перечисление.АукРезультатыВыполненияКоманд.ПустаяСсылка))
	|		ЛЕВОЕ СОЕДИНЕНИЕ втИсторияВыполненияОповещенийПоКоманде КАК втИсторияВыполненияОповещенийПоКоманде
	|		ПО втАукционы.Аукцион = втИсторияВыполненияОповещенийПоКоманде.Аукцион
	|ГДЕ
	|	втИсторияВыполнения.Аукцион ЕСТЬ NULL
	|	И НЕ втАукционы.АвтоматическоеПодведениеОкончательныхИтогов
	|	И ЕСТЬNULL(втИсторияВыполненияОповещенийПоКоманде.КоличествоОповещений, 0) < &МаксКоличествоОповещений
	|	И РАЗНОСТЬДАТ(ЕСТЬNULL(втИсторияВыполненияОповещенийПоКоманде.ПоследнееОповещение, ДАТАВРЕМЯ(1, 1, 1)), &ТекДата, МИНУТА) > &ДельтаМеждуОповещениями";
	
	Запрос.УстановитьПараметр("ТекДата",		?(пТекДата <> Неопределено, пТекДата, ОбщегоНазначенияВызовСервера.ТекущаяДатаСервер_()));
	Запрос.УстановитьПараметр("МаксКоличествоОповещений",	АукУправлениеАукционамиКлиентСервер.КоличествоСлужебныхОповещений());
	Запрос.УстановитьПараметр("ДельтаМеждуОповещениями",	АукУправлениеАукционамиКлиентСервер.ПромежутокВремениМеждуОповещениямиМинут());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат ЭдоОбщийСервер.РезультатЗапросаВМассивСтруктур(РезультатЗапроса);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЗначенияНачальныхДанных_Запрос(пАукцион, пВидАукциона, пУчастник)
	Если пВидАукциона = Неопределено Тогда	
		пВидАукциона = Справочники.АукАукционы.КлючевыеДанныеАукциона(пАукцион).ВидАукциона;	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Аук_АукционыНачальныеДанные.Участник КАК Участник,
	|	Аук_АукционыНачальныеДанные.СтрокаНачальныхДанных КАК СтрокаДанных,
	|	Аук_АукционыНачальныеДанные.ЭлементНачальныхДанных КАК ЭлементДанных,
	|	Аук_АукционыНачальныеДанные.ЗначениеНачальныхДанных КАК ЗначениеЭлементаДанных,
	|	АукЭлементыДанныхАукционов.ТехническоеНаименование КАК ТехническоеНаименование,
	|	АукЭлементыДанныхАукционов.Представление КАК ЭлементДанныхПредставление
	|ИЗ
	|	Справочник.АукАукционы.НачальныеДанные КАК Аук_АукционыНачальныеДанные
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.АукЭлементыДанныхАукционов КАК АукЭлементыДанныхАукционов
	|		ПО Аук_АукционыНачальныеДанные.ЭлементНачальныхДанных = АукЭлементыДанныхАукционов.Ссылка
	|ГДЕ
	|	Аук_АукционыНачальныеДанные.Ссылка = &Аукцион
	|	И &ОтборПоУчастнику
	|ИТОГИ ПО
	|	Участник,
	|	СтрокаДанных";
	
	Если пУчастник <> Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоУчастнику", "Аук_АукционыНачальныеДанные.Участник = &Участник");
		
		Запрос.УстановитьПараметр("Участник", пУчастник);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоУчастнику", "ИСТИНА");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Аукцион", пАукцион);
	
	Возврат Запрос;	
КонецФункции	

Функция ПорядковыйНомерСнимка(пТекущийАукцион)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(АукАукционы.Ссылка) КАК Количество
	|ИЗ
	|	Справочник.АукАукционы КАК АукАукционы
	|ГДЕ
	|	АукАукционы.ТекущийАукцион = &ТекущийАукцион";
	
	Запрос.УстановитьПараметр("ТекущийАукцион", пТекущийАукцион);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Количество + 1;	
	Иначе	
		Возврат 1;	
	КонецЕсли;	
	
КонецФункции	

#КонецОбласти
